# HostElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..HostElementId Property
BoundaryConditions Class See Also
---
The host element Id for the boundary conditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId HostElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostElementId {
	ElementId^ get ();
}
```

# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace